package com.example.Kau_Git.Service;

import org.springframework.stereotype.Service;

@Service
public class CheckService {
    //서비스 코드
    // A01 - 자연, A02 - 문화/예술/역사, A03 - 여가/스포츠, A04 - 쇼핑, A05 - 요리, B01 - 교통, B02 - 숙박 서비스 분류 코드

    //Contentstype 코드 표  관광지(76), 문화시설(78), 행사/공연/축제(85), 여행코스(국문만 서비스),

    // 레포츠(75), 숙박(80), 쇼핑(79), 음식점(82), 교통(다국어만 서비스)(77)
    //지역 코드 표 서울 - 1, 인천 - 2, 대전 - 3, 대구 - 4, 광주 - 5, 부산 - 6, 울산 - 7, 세종 - 8, 경기도 - 31, 강원도 - 32
    //충북 -33, 충남 -34, 경북 -35, 경남 - 36, 전북 -37, 전남 - 38 제주 -39


    //contentsid -> 6글자인데 다 각각 달라짐. 고유해서 이거 사용 못할듯
    



}
